In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx',index_col='지원번호')
df.sort_index(ascending=True,inplace=True)

In [2]:
# 학교별 학생수
df['학교'].value_counts()

학교
구로고    5
단지고    3
Name: count, dtype: int64

In [4]:
df.groupby('학교')['키'].mean()

학교
구로고    184.800000
단지고    193.333333
Name: 키, dtype: float64

In [3]:
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [5]:
df.groupby(['학교','학년']).size()

학교   학년
구로고  1     2
     2     1
     3     2
단지고  2     2
     3     1
dtype: int64

In [6]:
df.groupby(['학교','학년'])['키'].mean()

학교   학년
구로고  1     187.5
     2     168.0
     3     190.5
단지고  2     189.0
     3     202.0
Name: 키, dtype: float64

In [7]:
# 학교와 학년의 키 평균 출력
df.groupby(['학교','학년'])['키'].mean()

학교   학년
구로고  1     187.5
     2     168.0
     3     190.5
단지고  2     189.0
     3     202.0
Name: 키, dtype: float64

In [13]:
# 학교와 학년 별 합계 출력
df.groupby(['학교','학년']).sum()
df.groupby(['학교','학년'])['이름'].count()
df.groupby(['학교','학년']).count()
df.groupby(['학교','학년'])[['이름','SW특기']].count()
df.groupby(['학교','학년'])[['국어','키']].mean()

          국어      키
학교  학년
구로고 1   27.5  187.5
    2   80.0  168.0
    3   65.0  190.5
단지고 2   77.5  189.0
    3   80.0  202.0

In [19]:
school= df.groupby('학교').get_group('구로고')
school

       이름   학교  학년    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고   3  197  90  85  100  95  85      Python
2번    강태원  구로고   3  184  40  35   50  55  25        Java
3번    강호림  구로고   2  168  80  75   70  80  75  javascript
4번    김수진  구로고   1  187  40  60   70  75  80         NaN
5번    김재욱  구로고   1  188  15  20   10  35  10         NaN

In [20]:
school['학년'].value_counts()

학년
3    2
1    2
2    1
Name: count, dtype: int64

In [21]:
df.groupby(['학교','학년']).size()

학교   학년
구로고  1     2
     2     1
     3     2
단지고  2     2
     3     1
dtype: int64

In [22]:
df[['학교','학년']].value_counts()

학교   학년
구로고  1     2
     3     2
단지고  2     2
구로고  2     1
단지고  3     1
Name: count, dtype: int64

In [25]:
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [24]:
school = df.groupby('학교')
school['학년'].value_counts().loc['구로고']

학년
1    2
3    2
2    1
Name: count, dtype: int64

In [29]:
# 학년별 인원수
school['학년'].value_counts().loc['구로고']
# 학년별 퍼센트
school['학년'].value_counts(normalize=True).loc['구로고']*100

학년
1    40.0
3    40.0
2    20.0
Name: proportion, dtype: float64

In [30]:
(school['학년'].value_counts(normalize=True).loc['구로고']*100).astype(str)+'%'

학년
1    40.0%
3    40.0%
2    20.0%
Name: proportion, dtype: object

In [32]:
import pandas as pd
df = pd.read_csv('students.csv',index_col=0)
df
# 성별로 그룹 묶어서 인원수를 출력하시오
df.groupby('gender').size()

gender
F    515
M    485
dtype: int64

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   object
 1   pw          1000 non-null   int64
 2   name        1000 non-null   object
 3   phone       1000 non-null   object
 4   email       1000 non-null   object
 5   address     1000 non-null   object
 6   gender      1000 non-null   object
 7   major       1000 non-null   object
 8   grade       1000 non-null   int64
 9   hobby       1000 non-null   object
 10  ip_address  1000 non-null   object
dtypes: int64(2), object(9)
memory usage: 93.8+ KB

In [34]:
df.describe()

                pw        grade
count  1000.000000  1000.000000
mean   5451.412000     2.512000
std    2561.837819     1.122995
min    1011.000000     1.000000
25%    3322.500000     2.000000
50%    5384.500000     3.000000
75%    7627.750000     4.000000
max    9994.000000     4.000000

In [39]:
df.groupby('grade').size()
(df['grade'].value_counts(normalize=True)*100).astype(str)+'%'

grade
4    25.6%
1    24.9%
3    24.9%
2    24.6%
Name: proportion, dtype: object

In [ ]:
df.groupby('grade').value_counts()